examples-results/HsacExamples.SlimTests.HttpTests.HttpPost2UsingScenarioTest.html

<html><head><title>HsacExamples.SlimTests.HttpTests.HttpPost2UsingScenarioTest</title><meta http-equiv='Content-Type' content='text/html;charset=UTF-8'/><link rel='stylesheet' type='text/css' href='css/fitnesse.css'/><script src='javascript/jquery-1.11.3.min.js' type='text/javascript'></script><script src='javascript/fitnesse.js' type='text/javascript'></script></head><body><header><h2>HsacExamples.SlimTests.HttpTests.HttpPost2UsingScenarioTest</h2></header><article><br/><h2 id="Bodyviascenario">Body via scenario</h2>
<br/>Using a scenario allows us to generate multiple request, only changing certain values.<br/><br/><div class="collapsible closed"><ul><li><a href='#' class='expandall'>Expand</a></li><li><a href='#' class='collapseall'>Collapse</a></li></ul>
	<p class="title">Scenario definition</p>
	<div><span class="meta">variable defined: POST_BODY_2= {{{
&lt;s11:Envelope xmlns:s11="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s11:Body&gt;
    &lt;ns1:AddInteger xmlns:ns1="http://tempuri.org"&gt;
      &lt;ns1:Arg1&gt;@{arg1}&lt;/ns1:Arg1&gt;
      &lt;ns1:Arg2&gt;@{arg2}&lt;/ns1:Arg2&gt;
    &lt;/ns1:AddInteger&gt;
  &lt;/s11:Body&gt;
&lt;/s11:Envelope&gt;
}}} </span>
<br/><br/><table>
	<tr class="slimRowTitle">
		<td>script</td>
		<td><span class="pass">xml http test</span></td>
	</tr>
</table>
<br/><table>
	<tr>
		<td>table template</td>
		<td colspan="3">send request</td>
	</tr>
	<tr>
		<td>set value</td>
		<td><a href="http://tempuri.org/SOAP.Demo.AddInteger">http://tempuri.org/SOAP.Demo.AddInteger</a></td>
		<td>for header</td>
		<td>SOAPAction</td>
	</tr>
	<tr>
		<td>post</td>
		<td><pre>
&lt;s11:Envelope xmlns:s11="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s11:Body&gt;
    &lt;ns1:AddInteger xmlns:ns1="http://tempuri.org"&gt;
      &lt;ns1:Arg1&gt;@{arg1}&lt;/ns1:Arg1&gt;
      &lt;ns1:Arg2&gt;@{arg2}&lt;/ns1:Arg2&gt;
    &lt;/ns1:AddInteger&gt;
  &lt;/s11:Body&gt;
&lt;/s11:Envelope&gt;
</pre></td>
		<td>to</td>
		<td>http://www.crcind.com/csp/samples/SOAP.Demo.cls</td>
	</tr>
	<tr>
		<td>check</td>
		<td>response status</td>
		<td colspan="2">200</td>
	</tr>
	<tr>
		<td>show</td>
		<td colspan="3">response</td>
	</tr>
	<tr>
		<td>register prefix</td>
		<td>tempuri</td>
		<td>for namespace</td>
		<td><a href="http://tempuri.org">http://tempuri.org</a></td>
	</tr>
	<tr>
		<td>$result=</td>
		<td>xPath</td>
		<td colspan="2">//tempuri:AddIntegerResult/text()</td>
	</tr>
</table>
</div>
</div>
<br/><table>
	<tr>
		<td colspan="3">send request</td>
	</tr>
	<tr>
		<td>arg1</td>
		<td>arg2</td>
		<td>result?</td>
	</tr>
	<tr class="scenario closed">
		<td>1</td>
		<td>1</td>
		<td><span class="pass">2</span></td>
	</tr><tr class="scenario-detail closed-detail"><td colspan="3"><table>
	<tr>
		<td>table template</td>
		<td colspan="3">send request</td>
	</tr>
	<tr>
		<td>set value</td>
		<td><a href="http://tempuri.org/SOAP.Demo.AddInteger">http://tempuri.org/SOAP.Demo.AddInteger</a></td>
		<td>for header</td>
		<td>SOAPAction</td>
	</tr>
	<tr>
		<td><span class="pass">post</span></td>
		<td><pre>
&lt;s11:Envelope xmlns:s11="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s11:Body&gt;
    &lt;ns1:AddInteger xmlns:ns1="http://tempuri.org"&gt;
      &lt;ns1:Arg1&gt;1&lt;/ns1:Arg1&gt;
      &lt;ns1:Arg2&gt;1&lt;/ns1:Arg2&gt;
    &lt;/ns1:AddInteger&gt;
  &lt;/s11:Body&gt;
&lt;/s11:Envelope&gt;
</pre></td>
		<td>to</td>
		<td>http://www.crcind.com/csp/samples/SOAP.Demo.cls</td>
	</tr>
	<tr>
		<td>check</td>
		<td>response status</td>
		<td colspan="2"><span class="pass">200</span></td>
	</tr>
	<tr>
		<td>show</td>
		<td colspan="3">response</td>
	<td><pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&lt;SOAP-ENV:Envelope xmlns:SOAP-ENV=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:s=&quot;http://www.w3.org/2001/XMLSchema&quot;&gt;
    &lt;SOAP-ENV:Body&gt;
        &lt;AddIntegerResponse xmlns=&quot;http://tempuri.org&quot;&gt;
            &lt;AddIntegerResult&gt;2&lt;/AddIntegerResult&gt;
        &lt;/AddIntegerResponse&gt;
    &lt;/SOAP-ENV:Body&gt;
&lt;/SOAP-ENV:Envelope&gt;
</pre></td></tr>
	<tr>
		<td>register prefix</td>
		<td>tempuri</td>
		<td>for namespace</td>
		<td><a href="http://tempuri.org">http://tempuri.org</a></td>
	</tr>
	<tr>
		<td>$result&lt;-[2]</td>
		<td>xPath</td>
		<td colspan="2">//tempuri:AddIntegerResult/text()</td>
	</tr>
</table></td></tr>
	<tr class="scenario closed">
		<td>34</td>
		<td>16</td>
		<td><span class="pass">50</span></td>
	</tr><tr class="scenario-detail closed-detail"><td colspan="3"><table>
	<tr>
		<td>table template</td>
		<td colspan="3">send request</td>
	</tr>
	<tr>
		<td>set value</td>
		<td><a href="http://tempuri.org/SOAP.Demo.AddInteger">http://tempuri.org/SOAP.Demo.AddInteger</a></td>
		<td>for header</td>
		<td>SOAPAction</td>
	</tr>
	<tr>
		<td><span class="pass">post</span></td>
		<td><pre>
&lt;s11:Envelope xmlns:s11="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s11:Body&gt;
    &lt;ns1:AddInteger xmlns:ns1="http://tempuri.org"&gt;
      &lt;ns1:Arg1&gt;34&lt;/ns1:Arg1&gt;
      &lt;ns1:Arg2&gt;16&lt;/ns1:Arg2&gt;
    &lt;/ns1:AddInteger&gt;
  &lt;/s11:Body&gt;
&lt;/s11:Envelope&gt;
</pre></td>
		<td>to</td>
		<td>http://www.crcind.com/csp/samples/SOAP.Demo.cls</td>
	</tr>
	<tr>
		<td>check</td>
		<td>response status</td>
		<td colspan="2"><span class="pass">200</span></td>
	</tr>
	<tr>
		<td>show</td>
		<td colspan="3">response</td>
	<td><pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&lt;SOAP-ENV:Envelope xmlns:SOAP-ENV=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:s=&quot;http://www.w3.org/2001/XMLSchema&quot;&gt;
    &lt;SOAP-ENV:Body&gt;
        &lt;AddIntegerResponse xmlns=&quot;http://tempuri.org&quot;&gt;
            &lt;AddIntegerResult&gt;50&lt;/AddIntegerResult&gt;
        &lt;/AddIntegerResponse&gt;
    &lt;/SOAP-ENV:Body&gt;
&lt;/SOAP-ENV:Envelope&gt;
</pre></td></tr>
	<tr>
		<td>register prefix</td>
		<td>tempuri</td>
		<td>for namespace</td>
		<td><a href="http://tempuri.org">http://tempuri.org</a></td>
	</tr>
	<tr>
		<td>$result&lt;-[50]</td>
		<td>xPath</td>
		<td colspan="2">//tempuri:AddIntegerResult/text()</td>
	</tr>
</table></td></tr>
</table>
</article></body></html>